tap "homebrew/bundle"
tap "homebrew/services"
brew "asciinema"
brew "autojump"
brew "bat"
brew "btop"
brew "difftastic"
brew "direnv"
brew "dosbox-staging"
brew "fzf"
brew "gcc"
brew "go"
brew "kubernetes-cli"
brew "kubectx"
brew "lsd"
brew "lua"
brew "luajit"
brew "luarocks"
brew "maven"
brew "mysql"
brew "mysql-client@8.4"
brew "neovim"
brew "node"
brew "protobuf"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "rustup"
brew "starship"
brew "tmux"
brew "uv"
brew "wget"
brew "zsh"
cask "1password"
cask "1password-cli"
cask "apifox"
cask "appcleaner"
cask "betterdisplay"
cask "brave-browser"
cask "chatgpt"
cask "cherry-studio"
cask "claude"
cask "cursor"
cask "datagrip"
cask "duckduckgo"
cask "fleet"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf-cn"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "intellij-idea"
cask "mac-mouse-fix"
cask "notion"
cask "orbstack"
cask "raycast"
cask "spotify"
cask "squirrel"
cask "stats"
cask "visual-studio-code@insiders"
cask "vnc-viewer"
cask "wechat"
cask "wezterm"
vscode "alefragnani.bookmarks"
vscode "eamodio.gitlens"
vscode "github.remotehub"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "rust-lang.rust-analyzer"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
