tap "anomalyco/tap"
tap "buo/cask-upgrade"
tap "farion1231/ccswitch"
tap "minio/stable"
tap "oven-sh/bun"
tap "vitobotta/tap"
brew "argocd"
brew "asciinema"
brew "autojump"
brew "bat"
brew "btop"
brew "cmake"
brew "difftastic"
brew "direnv"
brew "dosbox-staging"
brew "duckdb"
brew "expect"
brew "fzf"
brew "gcc"
brew "gh"
brew "gnu-sed"
brew "go"
brew "grep"
brew "helm"
brew "helmfile"
brew "iperf3"
brew "juicefs"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "lrzsz"
brew "lsd"
brew "lua"
brew "luajit"
brew "luarocks"
brew "mas"
brew "maven"
brew "protobuf"
brew "mysql"
brew "mysql-client@8.4"
brew "neofetch"
brew "neovim"
brew "nexttrace"
brew "node"
brew "ripgrep"
brew "opencode"
brew "pnpm"
brew "postgresql@17", restart_service: :changed
brew "redis", restart_service: :changed
brew "rustup"
brew "starship"
brew "swiftformat"
brew "tmux"
brew "trzsz-ssh"
brew "uv"
brew "wget"
brew "xcbeautify"
brew "zsh"
brew "minio/stable/mc"
brew "oven-sh/bun/bun"
brew "vitobotta/tap/hetzner_k3s"
cask "1password"
cask "alacritty"
cask "antigravity"
cask "brave-browser"
cask "farion1231/ccswitch/cc-switch"
cask "chatgpt"
cask "cherry-studio"
cask "clash-party"
cask "claude"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "copilot-cli"
cask "datagrip"
cask "db-browser-for-sqlite"
cask "feishu"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf-cn"
cask "google-chrome"
cask "jordanbaird-ice"
cask "kiro"
cask "kiro-cli"
cask "navicat-premium-lite"
cask "netnewswire"
cask "notion"
cask "obsidian"
cask "only-switch"
cask "orbstack"
cask "qq"
cask "raycast"
cask "spotify"
cask "stats"
cask "teamviewer"
cask "telegram"
cask "typeless"
cask "visual-studio-code@insiders"
cask "wechat"
cask "wechatwork"
cask "wetype"
cask "wpsoffice-cn"
mas "1Password for Safari", id: 1569813296
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tailscale", id: 1475387142
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "donjayamanne.githistory"
vscode "dreamecho.git-blame-lens"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "meta.pyrefly"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "openai.chatgpt"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
go "rsc.io/2fa"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/go-delve/delve/cmd/dlv"
go "entgo.io/ent/cmd/ent"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "github.com/zeromicro/go-zero/tools/goctl"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "github.com/go-kratos/kratos/cmd/kratos/v2"
go "go.uber.org/mock/mockgen"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/go-kratos/kratos/cmd/protoc-gen-go-http/v2"
go "github.com/google/gnostic/cmd/protoc-gen-openapi"
go "github.com/kyoh86/richgo"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
go "github.com/google/wire/cmd/wire"
cargo "sqlx-cli"
