tap "farion1231/ccswitch"
tap "homebrew/cask"
tap "minio/stable"
tap "telepresenceio/telepresence"
tap "vitobotta/tap"
brew "act"
brew "argocd"
brew "asciinema"
brew "autojump"
brew "bat"
brew "btop"
brew "cmake"
brew "ripgrep"
brew "codex"
brew "difftastic"
brew "direnv"
brew "dosbox-staging"
brew "duckdb"
brew "expect"
brew "fzf"
brew "gcc"
brew "node"
brew "gemini-cli"
brew "gh"
brew "gnu-sed"
brew "go"
brew "grep"
brew "helm"
brew "helmfile"
brew "iperf3"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "lrzsz"
brew "lsd"
brew "lua"
brew "luajit"
brew "luarocks"
brew "mas"
brew "maven"
brew "protobuf"
brew "mysql"
brew "mysql-client@8.4"
brew "neofetch"
brew "neovim"
brew "nexttrace"
brew "opencode"
brew "postgresql@17"
brew "qwen-code"
brew "rclone"
brew "redis", restart_service: :changed
brew "rustup"
brew "starship"
brew "swiftformat"
brew "tmux"
brew "trzsz-ssh"
brew "uv"
brew "wget"
brew "xcbeautify"
brew "xcode-build-server"
brew "yarn"
brew "zsh"
brew "minio/stable/mc"
brew "telepresenceio/telepresence/telepresence-oss"
brew "vitobotta/tap/hetzner_k3s"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "apifox"
cask "appcleaner"
cask "battle-net"
cask "brave-browser"
cask "farion1231/ccswitch/cc-switch"
cask "chatgpt"
cask "cherry-studio"
cask "clash-verge-rev"
cask "claude"
cask "claude-code"
cask "copilot-cli"
cask "craft"
cask "cursor"
cask "daisydisk"
cask "datagrip"
cask "eudic"
cask "figma"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf-cn"
cask "gcloud-cli"
cask "ghostty"
cask "github-copilot-for-xcode"
cask "google-chrome"
cask "google-drive"
cask "intellij-idea-ce"
cask "jordanbaird-ice"
cask "kiro"
cask "mac-mouse-fix"
cask "netnewswire"
cask "notion"
cask "obsidian"
cask "only-switch"
cask "orbstack"
cask "raycast"
cask "sourcetree"
cask "spotify"
cask "squirrel-app"
cask "stats"
cask "steam"
cask "telegram"
cask "visual-studio-code"
cask "wechat"
mas "Cult Of The Lamb", id: 1639580858
mas "HamHub", id: 6458691598
mas "Keynote", id: 409183694
mas "Lark", id: 6449830127
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDFgear", id: 6469021132
mas "PowerWash Simulator", id: 6477445344
mas "Quantumult X", id: 1443988620
mas "SenPlayer", id: 6443975850
mas "Shadowrocket", id: 932747118
mas "The Unarchiver", id: 425424353
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
mas "网易爆米花", id: 6553989480
vscode "anthropic.claude-code"
vscode "donjayamanne.githistory"
vscode "dreamecho.git-blame-lens"
vscode "eamodio.gitlens"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "meta.pyrefly"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "openai.chatgpt"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
go "rsc.io/2fa"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/go-delve/delve/cmd/dlv"
go "entgo.io/ent/cmd/ent"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "github.com/zeromicro/go-zero/tools/goctl"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "github.com/go-kratos/kratos/cmd/kratos/v2"
go "go.uber.org/mock/mockgen"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/go-kratos/kratos/cmd/protoc-gen-go-http/v2"
go "github.com/google/gnostic/cmd/protoc-gen-openapi"
go "github.com/kyoh86/richgo"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
go "github.com/google/wire/cmd/wire"
cargo "sqlx-cli"
