arch-install-scripts
autoconf
autojump
automake
base
bat
binutils
bison
bpytop
cmake
docker
fakeroot-tcp
fd
flex
fzf
gcc
git
groff
helm
inetutils
kubectl
kubectx
libxslt
lsd
lua
m4
make
man-db
nano
neovim
nodejs-lts-gallium
npm
openssh
patch
pkgconf
python-pip
ripgrep
rsync
rust
starship
stylua
subsystemctl
sudo
syncthing
tmux
unzip
vim
which
yay
zsh
